[
  {
    "date": 1904,
    "text": "Winston MC Dickson PO ’1904 the first Black student at the 5Cs earned his degree from Pomona College",
    "photo": "dickson",
    "links": ""
  },
  {
    "date": 1919,
    "text": "Arthur Williams PO ‘1919 graduated almost two decades after Dickson’s arrival",
    "photo": "arthur-williams",
    "links": ""
  },
  {
    "date": 1948,
    "text": "The next known Black student to attend the 5Cs was Williams’s daughter Eileen Williams PO ‘48",
    "photo": "eileen-williams",
    "links": ""
  },
  {
    "date": 1958,
    "text": "The first two Black students to attend Scripps College enrolled in 1958 but transferred after one year",
    "photo": "eileen-williams",
    "links": ""
  },
  {
    "date": 1962,
    "text": "More Black students began to roll back into Claremont by 1958, starting with Willie Benton Boone PO ‘62",
    "photo": "boone",
    "links": ""
  },
  {
    "date": "Spring 1967",
    "text": "First intercollegiate BSU founded by Danny Wilks PO ’71",
    "photo": "wilks",
    "links": ""
  },
  {
    "date": "May 1, 1968",
    "text": "BSU presented 10-point demands to the presidents of the 5Cs",
    "photo": "10point",
    "href": "https://pitzer.app.box.com/s/ombwukuufl70n8gysufce53ltv22aiaf/file/792324506276?sb=/details"
  },
  {
    "date": "May 30, 1968",
    "text": "5C presidents respond to BSU, offered a pledge to increase diversity efforts",
    "photo": "10pointresponse",
    "href": "https://app.box.com/s/k3ccollxkdl2nzlfk5dn8doop53h3qgs/file/920866992266"
  },
  {
    "date": "Jun. 1968",
    "text": "Administrative Council Committee on Minority Student Relations created to implement diversity pledge and three sub-committees focusing on admissions, housing and curriculum",
    "photo": "accmsr",
    "href": "https://pitzer.app.box.com/s/ombwukuufl70n8gysufce53ltv22aiaf/file/792325793345"
  },
  {
    "date": "Aug. 27, 1968",
    "text": "BSU demanded additional language in housing policy to prohibit housing discrimination on the basis of “race, creed or national origin",
    "photo": "housing",
    "href": "https://app.box.com/s/k3ccollxkdl2nzlfk5dn8doop53h3qgs/file/920865829159"
  },
  {
    "date": "Nov. 5, 1968",
    "text": "CMC approved a $2 tuition increase to fund a scholarship centered on minority students",
    "photo": "cmc-tuition",
    "href": "https://app.box.com/s/k3ccollxkdl2nzlfk5dn8doop53h3qgs/file/920869400693"
  },
  {
    "date": "Nov. 6, 1968",
    "text": "BSU held a “funeral” march, sit-in demonstration over racist candidates in national presidential election",
    "photo": "funeral",
    "href": "https://app.box.com/s/k3ccollxkdl2nzlfk5dn8doop53h3qgs/file/920884572366"
  },
  {
    "date": "Dec. 10, 1968",
    "text": "Black Panther co-founder and activist Bobby Seale spoke at Bridges Auditorium",
    "photo": "seale",
    "href": "https://app.box.com/s/k3ccollxkdl2nzlfk5dn8doop53h3qgs/file/920887926571"
  },
  {
    "date": "Jan. 6, 1969",
    "text": "5C Provost Mark Curtis announced a ten course Black studies program, doubling to eight Black faculty, and Center for Education Opportunity to increase POC student admissions at 5Cs",
    "photo": "",
    "links": ""
  },
  {
    "date": "Jan. 27, 1969",
    "text": "The BSU proposed the autonomous Black Studies Center to bolster Black enrollment, staff employment and curriculum",
    "photo": "",
    "links": ""
  },
  {
    "date": "Jan. 1969",
    "text": "Ethnic Studies Center alternative to BSC proposed by PZ Dean of Faculty John Rodman",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 1969",
    "text": "Trustees at the Colleges approved the creation of the Human Resource Institute, which would include a Black Studies Center and a Center for Mexican American Studies. A center for urban studies was proposed as well",
    "photo": "",
    "link": "https://pomona.app.box.com/file/922279286147"
  },
  {
    "date": "Feb. 1969",
    "text": "Trustees at the Colleges approved the creation of the Human Resource Institute, which would include a Black Studies Center and a Center for Mexican American Studies. A center for urban studies was proposed as well",
    "photo": "",
    "link": "https://www.pomona.edu/timeline/1960s/1969"
  },
  {
    "date": "Feb. 1969",
    "text": "CMC professors Harry, Fisk and Jaffa rejected the Black Studies Center in favor of a proposal that offered a Black-American studies minor and hired one additional Black professor",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 14, 1969",
    "text": "Scripps College President and faculty offered emphatic support of BSU’s Black Studies Center proposal and supported its immediate construction",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 18, 1969",
    "text": "BSU members Eileen Wilson PO ‘69, Danny Wilks PO ‘71 and John Payton PO ‘73 attended an open faculty meeting to voice their grievances over faculty inaction and the delay of the BSC",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 19, 1969",
    "text": "5C Provost released a faculty resolution that created a student-faculty advisory committee to address student grievances and find alternatives to the BSC to present in April 1969",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 21, 1969",
    "text": "Eight BSU members stormed out of Provost’s office in protest of the Provost’s committee resolution",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 25, 1969",
    "text": "Anonymous letter released to condemn the Provost’s committee creation as a blatant rejection of 5C black students",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 25, 1969",
    "text": "Harvey Mudd, Pitzer, Pomona and CMC faculty issued individual letters of recommendation in support of the Black Studies Center Proposal",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 25, 1969",
    "text": "Pomona’s Carnegie Hall and Scripp’s Balch Hall are bombed by an unknown perpetrator. 5C administration moved 65 Black and Latinx students off campus to protect students from being falsely accused and for fear of possible retaliation",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 26, 1969",
    "text": "The 5C administration and Provost unanimously approved the Black Studies Center",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 26, 1969",
    "text": "Provost retracted a special advisory committee created to find solutions to increase enrollment and enhance Black and Latinx student experience at 5Cs",
    "photo": "",
    "links": ""
  },
  {
    "date": "Feb. 28, 1969",
    "text": "BSU released a policy statement calling for the autonomy in the management of the BSC",
    "photo": "",
    "links": ""
  },
  {
    "date": "Mar. 4, 1969",
    "text": "BSU organized a boycott against the Office of the Provost to protest faculty delay in implementing Black Studies Center",
    "photo": "",
    "links": ""
  },
  {
    "date": "Mar. 4, 1969",
    "text": "500 students storm the office of Scripps College President and Provost of the Colleges Dr. Mark Curtis in protest of his objections to the demands for an autonomous BSC",
    "photo": "",
    "links": ""
  },
  {
    "date": "Mar. 6, 1969",
    "text": "A Scripps student and faculty member announced a picket line demonstration in support of the BSU policy statement for the construction of the BSC",
    "photo": "",
    "links": ""
  },
  {
    "date": "Mar. 7, 1969",
    "text": "Faculty and Students Together (FAST) hold their first meeting in Walker Lounge on how to support the Black Studies Center",
    "photo": "",
    "links": ""
  },
  {
    "date": "Mar. 9, 1969",
    "text": "A committee of BSU-appointed students, as well as faculty and administration is formed to begin planning the implementation of the Black Studies Center",
    "photo": "",
    "links": ""
  },
  {
    "date": "Apr. 3, 1969",
    "text": "The Intercollegiate Committee announced an action plan of the BSC to increase enrollment, reallocate housing, and develop Black Studies curriculum",
    "photo": "apr3",
    "link": "https://pomona.app.box.com/file/797623358676"
  },
  {
    "date": "Sep. 1969",
    "text": "In collaboration with the 5C Faculty, the construction of Black Student Union’s autonomous Black Studies Center is completed",
    "link": "https://scholarship.claremont.edu/cgi/viewcontent.cgi?article=1008&context=cclura_2018",
    "photo": ""
  }
]